{
  "architectures": [
    "Blip2ForConditionalGeneration"
  ],
  "image_text_hidden_size": 256,
  "image_token_index": 32100,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "model_type": "blip-2",
  "num_query_tokens": 32,
  "qformer_config": {
    "_attn_implementation_autoset": true,
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "cross_attention_frequency": 2,
    "encoder_hidden_size": 1408,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "blip_2_qformer",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "position_embedding_type": "absolute",
    "torch_dtype": "float16",
    "use_qformer_text_input": false,
    "vocab_size": 30522
  },
  "text_config": {
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "bos_token_id": 1,
    "classifier_dropout": 0.0,
    "d_ff": 5120,
    "d_kv": 64,
    "d_model": 2048,
    "decoder_start_token_id": 0,
    "dense_act_fn": "gelu",
    "dropout_rate": 0.1,
    "feed_forward_proj": "gated-gelu",
    "initializer_factor": 1.0,
    "is_gated_act": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 512,
    "num_decoder_layers": 24,
    "num_heads": 32,
    "num_layers": 24,
    "output_past": true,
    "relative_attention_max_distance": 128,
    "relative_attention_num_buckets": 32,
    "task_specific_params": {
      "summarization": {
        "early_stopping": true,
        "length_penalty": 2.0,
        "max_length": 200,
        "min_length": 30,
        "no_repeat_ngram_size": 3,
        "num_beams": 4,
        "prefix": "summarize: "
      },
      "translation_en_to_de": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to German: "
      },
      "translation_en_to_fr": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to French: "
      },
      "translation_en_to_ro": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to Romanian: "
      }
    },
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "use_cache": true,
    "vocab_size": 32128
  },
  "torch_dtype": "float32",
  "transformers_version": "4.51.1",
  "use_decoder_only_language_model": false,
  "vision_config": {
    "_attn_implementation_autoset": true,
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 1408,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 1e-10,
    "intermediate_size": 6144,
    "layer_norm_eps": 1e-06,
    "model_type": "blip_2_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 39,
    "patch_size": 14,
    "projection_dim": 512,
    "qkv_bias": true,
    "torch_dtype": "float16"
  }
}
